Revit.Elements.FamilySymbol
A Revit FamilySymbol

Revit.Elements.FamilySymbol.#ctor(Autodesk.Revit.DB.FamilySymbol)
Private constructor for build a DSFamilySymbol
symbol:

Revit.Elements.FamilySymbol.InitFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
Initialize a FamilySymbol element
symbol:

Revit.Elements.FamilySymbol.InternalSetFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
Set the internal model of the family symbol along with its ElementId and UniqueId
symbol:

Revit.Elements.FamilySymbol.ByFamilyAndName(Revit.Elements.Family,System.String)
Select a FamilySymbol given it's parent Family and the FamilySymbol's name.
family: The FamilySymbol's parent Family
name: The name of the FamilySymbol
Returns:

Revit.Elements.FamilySymbol.ByFamilyNameAndTypeName(System.String,System.String)
Select a FamilySymbol give it's family name and type name.
familyName: The FamilySymbol's parent Family name.
typeName: The name of the FamilySymbol.
Returns:

Revit.Elements.FamilySymbol.ByName(System.String)
Select a FamilySymbol given it's name.  This method will return the first FamilySymbol it finds if there are
two or more FamilySymbol's with the same name.
name: The name of the FamilySymbol
Returns:

Revit.Elements.FamilySymbol.FromExisting(Autodesk.Revit.DB.FamilySymbol,System.Boolean)
Obtain a FamilySymbol by selection.
familySymbol:
isRevitOwned:
Returns:

Revit.Elements.FamilySymbol.InternalFamilySymbol
Internal wrapper property

Revit.Elements.FamilySymbol.InternalElement
Reference to the Element

Revit.Elements.FamilySymbol.Name
Get the name of this Family Symbol

Revit.Elements.FamilySymbol.Family
Get the parent family of this FamilySymbol